user/tutorials/pISAT/counterFlowFlame2D_GRI_TDAC/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs            ( "libchemistryModelS.so" "libchemistryModelPT.so" ); //"libParallelISATchemSlabDEV.so"

application     reactingFoam;

startFrom       startTime;

startTime       0.04;

stopAt          endTime;

endTime         0.045;

deltaT          1e-6;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.4;

//memorySize   60000;//300000000;//60000;//300000000;

memorySize
{
  G 3;
  M 0;
  K 0;
  B 0;
}

maxMemBlock   60000;


// ************************************************************************* //
